Examinator/src/InformationRegisters/БиблиотекаПользователейМеткиРесурсовСУО/БиблиотекаПользователейМеткиРесурсовСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БиблиотекаПользователейМеткиРесурсовСУО</name>
  <attributes>
    <name>Метка</name>
    <type>
      <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ресурс</name>
    <type>
      <types>CatalogRef.ЛитератураСУО</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.ЗаданияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Фрагмент</name>
    <type>
      <types>CatalogRef.СодержаниеКнигиСУО</types>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/БиблиотекаПользователейМеткиРесурсовСУО/ManagerModule.bsl
Функция ТаблицаПользовательскихМеток(Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БиблиотекаПользователейМеткиРесурсовСУО.Ресурс,
		|	БиблиотекаПользователейМеткиРесурсовСУО.Фрагмент,
		|	БиблиотекаПользователейМеткиРесурсовСУО.Метка
		|ИЗ
		|	РегистрСведений.БиблиотекаПользователейМеткиРесурсовСУО КАК БиблиотекаПользователейМеткиРесурсовСУО
		|ГДЕ
		|	БиблиотекаПользователейМеткиРесурсовСУО.Пользователь = &Пользователь";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);

	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();
	
КонецФункции
